<?xml version="1.0" ?>
<net name="white_box_cartoonization_freeze_graph" version="10">
	<layers>
		<layer id="0" name="truediv_5/reciprocal_/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="1,720,720,1" size="2073600"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>720</dim>
					<dim>720</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="truediv_3/reciprocal_/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="1,720,720,1" size="2073600"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>720</dim>
					<dim>720</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="input:0" type="Parameter" version="opset1">
			<data element_type="f32" shape="1,720,720,3"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>720</dim>
					<dim>720</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="mul_2" type="Multiply" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>720</dim>
					<dim>720</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>720</dim>
					<dim>720</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>720</dim>
					<dim>720</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="depthwise_4__45/Cast_14921_const" type="Const" version="opset1">
			<data element_type="i64" offset="2073600" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="depthwise_4__45" type="Transpose" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>720</dim>
					<dim>720</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>720</dim>
					<dim>720</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="46964699_const" type="Const" version="opset1">
			<data element_type="f32" offset="2073632" shape="3,1,1,3,3" size="108"/>
			<output>
				<port id="1" precision="FP32">
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="depthwise_4" type="GroupConvolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>720</dim>
					<dim>720</dim>
				</port>
				<port id="1">
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>720</dim>
					<dim>720</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="depthwise_4__49/Cast_14923_const" type="Const" version="opset1">
			<data element_type="i64" offset="2073740" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="depthwise_4__49" type="Transpose" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>720</dim>
					<dim>720</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>720</dim>
					<dim>720</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="truediv_3/mul_" type="Multiply" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>720</dim>
					<dim>720</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>720</dim>
					<dim>720</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>720</dim>
					<dim>720</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="truediv/reciprocal_/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="1,720,720,1" size="2073600"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>720</dim>
					<dim>720</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="generator/Conv/Conv2D__5/Cast_14875_const" type="Const" version="opset1">
			<data element_type="i64" offset="2073600" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="generator/Conv/Conv2D__5" type="Transpose" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>720</dim>
					<dim>720</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>720</dim>
					<dim>720</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="47124715_const" type="Const" version="opset1">
			<data element_type="f32" offset="2073632" shape="3,1,1,3,3" size="108"/>
			<output>
				<port id="1" precision="FP32">
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="depthwise_1" type="GroupConvolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>720</dim>
					<dim>720</dim>
				</port>
				<port id="1">
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>720</dim>
					<dim>720</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="depthwise_1__64/Cast_14899_const" type="Const" version="opset1">
			<data element_type="i64" offset="2073740" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="depthwise_1__64" type="Transpose" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>720</dim>
					<dim>720</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>720</dim>
					<dim>720</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="truediv/mul_" type="Multiply" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>720</dim>
					<dim>720</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>720</dim>
					<dim>720</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>720</dim>
					<dim>720</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="mul_3" type="Multiply" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>720</dim>
					<dim>720</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>720</dim>
					<dim>720</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>720</dim>
					<dim>720</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="sub_1/add_/sub" type="Subtract" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>720</dim>
					<dim>720</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>720</dim>
					<dim>720</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>720</dim>
					<dim>720</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="onnx_initializer_node_add/y:0/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="2073772" shape="1,1,1,1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="add" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>720</dim>
					<dim>720</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>720</dim>
					<dim>720</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="171/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="2073776" shape="1,1,1,1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="truediv_4/reciprocal_" type="Power" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>720</dim>
					<dim>720</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>720</dim>
					<dim>720</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="truediv_2/reciprocal_/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="1,720,720,1" size="2073600"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>720</dim>
					<dim>720</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="onnx_initializer_node_generator/Conv/weights/read/_2__cf__2:0/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="2073780" shape="32,3,7,7" size="18816"/>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>3</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="Conv__75/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="3,3" pads_end="3,3" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>720</dim>
					<dim>720</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>3</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>720</dim>
					<dim>720</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Conv__75/Dims1403/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="2092596" shape="1,32,1,1" size="128"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Conv__75" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>720</dim>
					<dim>720</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>720</dim>
					<dim>720</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="generator/LeakyRelu3708/Cast_14901_const" type="Const" version="opset1">
			<data element_type="f32" offset="2092724" shape="1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="generator/LeakyRelu3708" type="PReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>720</dim>
					<dim>720</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>720</dim>
					<dim>720</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="onnx_initializer_node_generator/Conv_1/weights/read/_4__cf__4:0/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="2092728" shape="32,32,3,3" size="36864"/>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Conv__78/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>720</dim>
					<dim>720</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>360</dim>
					<dim>360</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Conv__78/Dims1451/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="2129592" shape="1,32,1,1" size="128"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="Conv__78" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>360</dim>
					<dim>360</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>360</dim>
					<dim>360</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="generator/LeakyRelu_13712/Cast_14915_const" type="Const" version="opset1">
			<data element_type="f32" offset="2092724" shape="1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="generator/LeakyRelu_13712" type="PReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>360</dim>
					<dim>360</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>360</dim>
					<dim>360</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="onnx_initializer_node_generator/Conv_2/weights/read/_6__cf__6:0/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="2129720" shape="64,32,3,3" size="73728"/>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="Conv__79/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>360</dim>
					<dim>360</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>360</dim>
					<dim>360</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Conv__79/Dims1433/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="2203448" shape="1,64,1,1" size="256"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="Conv__79" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>360</dim>
					<dim>360</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>360</dim>
					<dim>360</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="generator/LeakyRelu_23720/Cast_14873_const" type="Const" version="opset1">
			<data element_type="f32" offset="2092724" shape="1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="generator/LeakyRelu_23720" type="PReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>360</dim>
					<dim>360</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>360</dim>
					<dim>360</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="onnx_initializer_node_generator/Conv_3/weights/read/_8__cf__8:0/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="2203704" shape="64,64,3,3" size="147456"/>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Conv__82/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>360</dim>
					<dim>360</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>180</dim>
					<dim>180</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="Conv__82/Dims1367/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="2351160" shape="1,64,1,1" size="256"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="Conv__82" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>180</dim>
					<dim>180</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>180</dim>
					<dim>180</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="generator/LeakyRelu_33744/Cast_14871_const" type="Const" version="opset1">
			<data element_type="f32" offset="2092724" shape="1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="generator/LeakyRelu_33744" type="PReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>180</dim>
					<dim>180</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>180</dim>
					<dim>180</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="onnx_initializer_node_generator/Conv_4/weights/read/_10__cf__10:0/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="2351416" shape="128,64,3,3" size="294912"/>
			<output>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Conv__83/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>180</dim>
					<dim>180</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>180</dim>
					<dim>180</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="Conv__83/Dims1469/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="2646328" shape="1,128,1,1" size="512"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="Conv__83" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>180</dim>
					<dim>180</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>180</dim>
					<dim>180</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="generator/LeakyRelu_43704/Cast_14885_const" type="Const" version="opset1">
			<data element_type="f32" offset="2092724" shape="1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="generator/LeakyRelu_43704" type="PReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>180</dim>
					<dim>180</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>180</dim>
					<dim>180</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="onnx_initializer_node_generator/block_0/conv1/weights/read/_24__cf__24:0/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="2646840" shape="128,128,3,3" size="589824"/>
			<output>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="Conv__86/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>180</dim>
					<dim>180</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>180</dim>
					<dim>180</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="Conv__86/Dims1427/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="3236664" shape="1,128,1,1" size="512"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="Conv__86" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>180</dim>
					<dim>180</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>180</dim>
					<dim>180</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="generator/block_0/LeakyRelu3732/Cast_14919_const" type="Const" version="opset1">
			<data element_type="f32" offset="2092724" shape="1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="generator/block_0/LeakyRelu3732" type="PReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>180</dim>
					<dim>180</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>180</dim>
					<dim>180</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="onnx_initializer_node_generator/block_0/conv2/weights/read/_26__cf__26:0/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="3237176" shape="128,128,3,3" size="589824"/>
			<output>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="Conv__87/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>180</dim>
					<dim>180</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>180</dim>
					<dim>180</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Conv__87/Dims1373/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="3827000" shape="1,128,1,1" size="512"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="Conv__87" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>180</dim>
					<dim>180</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>180</dim>
					<dim>180</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="generator/block_0/add" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>180</dim>
					<dim>180</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>180</dim>
					<dim>180</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>180</dim>
					<dim>180</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="onnx_initializer_node_generator/block_1/conv1/weights/read/_28__cf__28:0/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="3827512" shape="128,128,3,3" size="589824"/>
			<output>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="Conv__90/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>180</dim>
					<dim>180</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>180</dim>
					<dim>180</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="Conv__90/Dims1439/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="4417336" shape="1,128,1,1" size="512"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="Conv__90" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>180</dim>
					<dim>180</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>180</dim>
					<dim>180</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="generator/block_1/LeakyRelu3728/Cast_14909_const" type="Const" version="opset1">
			<data element_type="f32" offset="2092724" shape="1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="generator/block_1/LeakyRelu3728" type="PReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>180</dim>
					<dim>180</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>180</dim>
					<dim>180</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="onnx_initializer_node_generator/block_1/conv2/weights/read/_30__cf__30:0/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="4417848" shape="128,128,3,3" size="589824"/>
			<output>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Conv__91/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>180</dim>
					<dim>180</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>180</dim>
					<dim>180</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="Conv__91/Dims1463/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="5007672" shape="1,128,1,1" size="512"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="Conv__91" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>180</dim>
					<dim>180</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>180</dim>
					<dim>180</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="generator/block_1/add" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>180</dim>
					<dim>180</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>180</dim>
					<dim>180</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>180</dim>
					<dim>180</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="onnx_initializer_node_generator/block_2/conv1/weights/read/_32__cf__32:0/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="5008184" shape="128,128,3,3" size="589824"/>
			<output>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="Conv__94/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>180</dim>
					<dim>180</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>180</dim>
					<dim>180</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="Conv__94/Dims1415/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="5598008" shape="1,128,1,1" size="512"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Conv__94" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>180</dim>
					<dim>180</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>180</dim>
					<dim>180</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="generator/block_2/LeakyRelu3748/Cast_14911_const" type="Const" version="opset1">
			<data element_type="f32" offset="2092724" shape="1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="generator/block_2/LeakyRelu3748" type="PReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>180</dim>
					<dim>180</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>180</dim>
					<dim>180</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="onnx_initializer_node_generator/block_2/conv2/weights/read/_34__cf__34:0/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="5598520" shape="128,128,3,3" size="589824"/>
			<output>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="Conv__95/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>180</dim>
					<dim>180</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>180</dim>
					<dim>180</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Conv__95/Dims1379/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="6188344" shape="1,128,1,1" size="512"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Conv__95" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>180</dim>
					<dim>180</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>180</dim>
					<dim>180</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="generator/block_2/add" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>180</dim>
					<dim>180</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>180</dim>
					<dim>180</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>180</dim>
					<dim>180</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="onnx_initializer_node_generator/block_3/conv1/weights/read/_36__cf__36:0/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="6188856" shape="128,128,3,3" size="589824"/>
			<output>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="Conv__98/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>180</dim>
					<dim>180</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>180</dim>
					<dim>180</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="Conv__98/Dims1397/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="6778680" shape="1,128,1,1" size="512"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="Conv__98" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>180</dim>
					<dim>180</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>180</dim>
					<dim>180</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="generator/block_3/LeakyRelu3740/Cast_14907_const" type="Const" version="opset1">
			<data element_type="f32" offset="2092724" shape="1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="generator/block_3/LeakyRelu3740" type="PReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>180</dim>
					<dim>180</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>180</dim>
					<dim>180</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="onnx_initializer_node_generator/block_3/conv2/weights/read/_38__cf__38:0/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="6779192" shape="128,128,3,3" size="589824"/>
			<output>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="Conv__99/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>180</dim>
					<dim>180</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>180</dim>
					<dim>180</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="Conv__99/Dims1457/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="7369016" shape="1,128,1,1" size="512"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="Conv__99" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>180</dim>
					<dim>180</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>180</dim>
					<dim>180</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="generator/block_3/add" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>180</dim>
					<dim>180</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>180</dim>
					<dim>180</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>180</dim>
					<dim>180</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="onnx_initializer_node_generator/Conv_5/weights/read/_12__cf__12:0/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="7369528" shape="64,128,3,3" size="294912"/>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="Conv__100/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>180</dim>
					<dim>180</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>180</dim>
					<dim>180</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="Conv__100/Dims1385/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="7664440" shape="1,64,1,1" size="256"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="Conv__100" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>180</dim>
					<dim>180</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>180</dim>
					<dim>180</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="generator/LeakyRelu_53752/Cast_14913_const" type="Const" version="opset1">
			<data element_type="f32" offset="2092724" shape="1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="generator/LeakyRelu_53752" type="PReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>180</dim>
					<dim>180</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>180</dim>
					<dim>180</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="Interpolate/generator/ResizeBilinear/Cast_14879_const" type="Const" version="opset1">
			<data element_type="i64" offset="7664696" shape="2" size="16"/>
			<output>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="Interpolate/generator/ResizeBilinear" type="Interpolate" version="opset1">
			<data align_corners="0" antialias="0" axes="2,3" mode="linear" pads_begin="0" pads_end="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>180</dim>
					<dim>180</dim>
				</port>
				<port id="1">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>360</dim>
					<dim>360</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="generator/add" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>360</dim>
					<dim>360</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>360</dim>
					<dim>360</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>360</dim>
					<dim>360</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="onnx_initializer_node_generator/Conv_6/weights/read/_14__cf__14:0/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="7664712" shape="64,64,3,3" size="147456"/>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="Conv__101/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>360</dim>
					<dim>360</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>360</dim>
					<dim>360</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="Conv__101/Dims1409/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="7812168" shape="1,64,1,1" size="256"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="Conv__101" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>360</dim>
					<dim>360</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>360</dim>
					<dim>360</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="generator/LeakyRelu_63716/Cast_14903_const" type="Const" version="opset1">
			<data element_type="f32" offset="2092724" shape="1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="generator/LeakyRelu_63716" type="PReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>360</dim>
					<dim>360</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>360</dim>
					<dim>360</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="onnx_initializer_node_generator/Conv_7/weights/read/_16__cf__16:0/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="7812424" shape="32,64,3,3" size="73728"/>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="Conv__102/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>360</dim>
					<dim>360</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>360</dim>
					<dim>360</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="Conv__102/Dims1421/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="7886152" shape="1,32,1,1" size="128"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="Conv__102" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>360</dim>
					<dim>360</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>360</dim>
					<dim>360</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="generator/LeakyRelu_73736/Cast_14905_const" type="Const" version="opset1">
			<data element_type="f32" offset="2092724" shape="1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="generator/LeakyRelu_73736" type="PReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>360</dim>
					<dim>360</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>360</dim>
					<dim>360</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="Interpolate/generator/ResizeBilinear_1/Cast_14889_const" type="Const" version="opset1">
			<data element_type="i64" offset="7886280" shape="2" size="16"/>
			<output>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="Interpolate/generator/ResizeBilinear_1" type="Interpolate" version="opset1">
			<data align_corners="0" antialias="0" axes="2,3" mode="linear" pads_begin="0" pads_end="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>360</dim>
					<dim>360</dim>
				</port>
				<port id="1">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>720</dim>
					<dim>720</dim>
				</port>
			</output>
